/*

    ███████╗ █████╗ ███╗   ███╗ ██████╗ ██╗   ██╗███████╗     ██████╗  ██████╗  ██████╗ ██╗  ██╗
    ██╔════╝██╔══██╗████╗ ████║██╔═══██╗██║   ██║██╔════╝    ██╔════╝ ██╔═████╗██╔═████╗██║ ██╔╝
    █████╗  ███████║██╔████╔██║██║   ██║██║   ██║███████╗    ███████╗ ██║██╔██║██║██╔██║█████╔╝ 
    ██╔══╝  ██╔══██║██║╚██╔╝██║██║   ██║██║   ██║╚════██║    ██╔═══██╗████╔╝██║████╔╝██║██╔═██╗ 
    ██║     ██║  ██║██║ ╚═╝ ██║╚██████╔╝╚██████╔╝███████║    ╚██████╔╝╚██████╔╝╚██████╔╝██║  ██╗
    ╚═╝     ╚═╝  ╚═╝╚═╝     ╚═╝ ╚═════╝  ╚═════╝ ╚══════╝     ╚═════╝  ╚═════╝  ╚═════╝ ╚═╝  ╚═╝
                                      [ 𝘽𝙮𝙩𝙚𝙗𝙚𝙖𝙩 𝙀𝙙𝙞𝙩𝙞𝙤𝙣 ] 
                                     
❀ 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡 𝙎𝙤𝙣𝙜 𝙛𝙧𝙤𝙢 𝙈𝙞𝙘𝙝𝙖𝙚𝙡'𝙨 𝘽𝙁𝘽 𝘼𝙡𝙗𝙪𝙢 𝙤𝙣 𝙎𝙥𝙤𝙩𝙞𝙛𝙮 - 𝘾𝙤𝙙𝙚 𝙗𝙮 𝙪/𝙛𝙚𝙚𝙨𝙝𝙗𝙧𝙚𝙖𝙙 - 𝙍𝙚𝙢𝙖𝙠𝙚𝙙 𝙗𝙮 𝙋𝙧𝙞𝙣𝙘𝙚𝙨𝙨𝙋𝙧𝙞𝙨𝙘𝙞𝙡𝙡𝙖𝙋𝙏 ❀
[ https://open.spotify.com/album/7LrwIvSOSlL6u7UFCVLihm ]

*/

// [ 𝙎𝙤𝙣𝙜 𝙋𝙧𝙚𝙛𝙚𝙧𝙚𝙣𝙘𝙚𝙨 ]
Octave = 0,
Pitch  = 0,
Cents  = 0,
p      = round(Pitch)+(Octave*12)+(Cents/100),

// [ 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡 𝘽𝙖𝙨𝙨 𝙎𝙚𝙦𝙪𝙚𝙣𝙘𝙚 ]
b1=[-1,1,3,-2,-1,1,3,6][(t>>16)%8],

// [ 𝘼𝙡𝙩𝙚𝙧𝙣𝙖𝙩𝙞𝙫𝙚 𝘽𝙖𝙨𝙨 𝙎𝙚𝙦𝙪𝙚𝙣𝙘𝙚 ]
b2=[3,-2,-1,1][(t>>16)%4],

// 𝙙𝙤𝙣'𝙩 𝙘𝙖𝙧𝙚 𝙖𝙗𝙤𝙪𝙩 𝙩𝙝𝙞𝙨
t?0:(fb1=0,fb=0,f=[],lp=(a,c)=>(li=fi++,f[li]??=0,f[li]+=(a-f[li])*c),hp=(a,c)=>a-lp(a,c),rhp=(a,c,r)=>(rhi=fi++,f[rhi]??=0,f[rhi]=hp(a+f[rhi]*r,c)),hb=(a,c,b)=>a+hp(a,c)*b,bp=(a,hc,lc)=>hp(lp(a,lc),hc),bb=(a,hc,lc,b)=>a+bp(a,hc,lc)*b,s=(a,cu,cd)=>(si=fi++,f[si]??=0,sr=f[si],f[si]+=(a-sr)*(sr<a?cu:cd)),n=c=>(ni=fi++,f[ni]??=0,f[ni]=f[ni]+(random()-.5-f[ni])*c),dm=1e5,d=(a,h,m,fbfn=x=>x)=>{di=fi++;f[di]??=Array(dm).fill(0);dw=dt%dm;df=a;du=0;for (let hd of h){dr=(dm+dt-round(hd.t))%dm;df+=f[di][dr]*hd.fb;du+=f[di][dr]*hd.m;}f[di][dw]=fbfn(df);return a*(1-m)+du*m;},cmp=(a,th,ra,at,rl,sc=a)=>(ci=fi++,f[ci],a/(s(max(abs(sc)-th,0),at,rl)/th*ra+1))),fi=0,dt=t,

t/=8,pt=t%4096,b=a=>t*2**(((b1+p+12.8635))/12)*1%a/2-32,kc=(1-(t/1024)%1)*!(t>>10&3),k=tanh(sin(20*sqrt(t%4096)**.6))*kc**.6*!(t>>12&0)*168,m=fb=(hp(bp(-fb+(((t*2**((parseInt('FFDA6D88AAIKIHDDFFDA68AADA8AHIDDFFDA6D88AAIKIHDDFFDFDHFFDA8AIHFD'[(t>>11)%64],36)+p+0.8635)/12)<<(1.25*(t>>[10,11][t/3>>10&1])&3)>>1&63)-(t>>10&31|1))&255),.05,.9),.08)),sb=sin((2e6+pt*8)*(1-(1/(pt*100+.1))*2)/71)*(max((1-pt/2048*2),0)**2)*2*kc*(t>>12&1),sc=(t/4096%1*.8+.2)*(1-kc)**1.3,sne=(1-((t/1024)%1)**[.9,.6][t>>10&1])**1.2,he=(1-((t/8192+.5)%1))**1.7,bs=b(255)/2-16,a=lr=>tanh(cmp(hb(bb(k+tanh(sb+1*rhp(n(.5),0,0))*he*120+hp(n(.6)*128*sne,.3),.025,.2,-.5)+2*sc*(2*cmp(d(m,[{t:300+(lr?sin:cos)(t/2e3)*180,m:1,fb:0},{t:24576,m:.5,fb:.875}],.55,x=>bp(x,.1,.6)),20,1,.01,.2e-3)+bb(1.5*lp(.7*hp(b(lr?127:129),.02)+bs,(1-((t/1024)%1))**2*.3+.02),.01,.2,-.5)),.5,-.4),50,1,.01,.1e-3)/40)*128*1.1,[min(max((a(0)),-128),127),min(max((a(1)),-128),127)]